import re

text = '''微信昵称：[...],
起始时间：[2021-04-26 00:00:00] 终止时间：[2021-04-28 22:29:42],
导出类型：[全部],
导出时间：[2021-04-28 22:29:59],

共5笔记录,
收入：0笔 0.00元,
支出：5笔 15.00元,
中性交易：0笔 0.00元,

注：
1. 充值/提现/理财通购买/零钱通存取/信用卡还款等交易，将计入中性交易。
2. 本明细仅展示当前账单中的交易，不包括已删除的记录。
3. 本明细仅供个人对账使用。

----------------------微信支付账单明细列表--------------------

交易时间,交易类型,交易对方,商品,收/支,金额(元),支付方式,当前状态,交易单号,商户单号,备注
2021-04-28 08:28:47,商户消费,花小猪打车,"滴滴出行服务",支出,¥1.60,中信银行,支付成功,420000101320	,Gx	,"/"
2021-04-27 09:03:47,商户消费,花小猪打车,"滴滴出行服务",支出,¥4.80,中信银行,支付成功,420000101020	,fx	,"/"
2021-04-26 13:28:02,商户消费,花小猪打车,"滴滴出行服务",支出,¥3.50,中信银行,支付成功,420000100520	,hx	,"/"
2021-04-26 11:51:41,商户消费,花小猪打车,"滴滴出行服务",支出,¥3.50,中信银行,支付成功,420000100220	,7x	,"/"
2021-04-26 08:35:30,商户消费,花小猪打车,"滴滴出行服务",支出,¥1.60,中信银行,支付成功,420000100820	,ux	,"/"

'''

# 获取微信昵称
nickname = re.search(r'微信昵称：\[(.*?)\]', text).group(1)
print('微信昵称：', nickname)

# 获取起始时间和终止时间
start_time = re.search(r'起始时间：\[(.*?)\]', text).group(1)
end_time = re.search(r'终止时间：\[(.*?)\]', text).group(1)
print('起始时间：', start_time, '终止时间：', end_time)

# 获取交易明细
rows = re.findall(r'\n(.+?),(.+?),(.+?),(.+?),(.+?),(.+?),(.+?),(.+?),(.+?),(.+?),(.+?)\n', text)
print('交易明细：')
for row in rows:
    print(row)

# 获取总收入、总支出和中性交易
income = re.search(r'收入：(\d+)笔 (\d+\.\d+)元', text).group(2)
expense = re.search(r'支出：(\d+)笔 (\d+\.\d+)元', text).group(2)
neutral = re.search(r'中性交易：(\d+)笔 (\d+\.\d+)元', text).group(2)
print('收入：', income, '支出：', expense, '中性交易：', neutral)
